In [9]:
import pandas as pd

In [21]:
# create dataframe
commute = pd.read_csv('commute.csv')
commute

   TripID        Vehicle        Date  CommuteTime Destination Weather
0       0  Street Triple   11/8/2022         18.5    Franklin    rain
1       1  Street Triple   11/9/2022         19.0      Taylor     sun
2       2  Street Triple  11/10/2022         17.0    Franklin     sun
3       3         Passat  11/15/2022         22.0      Taylor    snow
4       4         Passat  11/16/2022         19.0      Taylor    snow
5       5         Passat  11/28/2022         21.0      Taylor    rain
6       6         Passat   12/2/2022         19.0    Franklin     sun
7       7  Street Triple   12/3/2022         20.0     Library     sun

In [20]:
commute['TripID']

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
Name: TripID, dtype: int64

In [22]:
commute['Vehicle']

0    Street Triple
1    Street Triple
2    Street Triple
3           Passat
4           Passat
5           Passat
6           Passat
7    Street Triple
Name: Vehicle, dtype: object

In [23]:
commute['Date']

0     11/8/2022
1     11/9/2022
2    11/10/2022
3    11/15/2022
4    11/16/2022
5    11/28/2022
6     12/2/2022
7     12/3/2022
Name: Date, dtype: object

In [24]:
commute['CommuteTime']

0    18.5
1    19.0
2    17.0
3    22.0
4    19.0
5    21.0
6    19.0
7    20.0
Name: CommuteTime, dtype: float64

In [25]:
commute['Destination']

0    Franklin
1      Taylor
2    Franklin
3      Taylor
4      Taylor
5      Taylor
6    Franklin
7     Library
Name: Destination, dtype: object

In [26]:
commute['Weather']

0    rain
1     sun
2     sun
3    snow
4    snow
5    rain
6     sun
7     sun
Name: Weather, dtype: object

In [28]:
commute[['CommuteTime', 'Destination', 'Weather']]

   CommuteTime Destination Weather
0         18.5    Franklin    rain
1         19.0      Taylor     sun
2         17.0    Franklin     sun
3         22.0      Taylor    snow
4         19.0      Taylor    snow
5         21.0      Taylor    rain
6         19.0    Franklin     sun
7         20.0     Library     sun

In [30]:
two_columns = ['Date', 'Vehicle']
commute[two_columns]

         Date        Vehicle
0   11/8/2022  Street Triple
1   11/9/2022  Street Triple
2  11/10/2022  Street Triple
3  11/15/2022         Passat
4  11/16/2022         Passat
5  11/28/2022         Passat
6   12/2/2022         Passat
7   12/3/2022  Street Triple

In [42]:
# iloc = current slices index
commute[two_columns].iloc[3]

Date       11/15/2022
Vehicle        Passat
Name: 3, dtype: object

In [48]:
# loc = index name (original)
commute[two_columns].loc[3]

Date       11/15/2022
Vehicle        Passat
Name: 3, dtype: object

In [49]:
# only works w. a single column
commute['Weather'][3]

'snow'

---

In [50]:
# can be applied to data frame objects - quantitative description of the elements (Only takes in floats)
commute.describe()

        TripID  CommuteTime
count  8.00000     8.000000
mean   3.50000    19.437500
std    2.44949     1.545443
min    0.00000    17.000000
25%    1.75000    18.875000
50%    3.50000    19.000000
75%    5.25000    20.250000
max    7.00000    22.000000

In [52]:
# find the average / most used w. any data type
commute['Vehicle'].mode()

0           Passat
1    Street Triple
Name: Vehicle, dtype: object

In [61]:
# set strings as categorical
commute_clean = commute.astype({
    'Date':'datetime64',
    'Vehicle':'category',
    'Weather':'category',
    'Destination':'category'
})
commute_clean

   TripID        Vehicle       Date  CommuteTime Destination Weather
0       0  Street Triple 2022-11-08         18.5    Franklin    rain
1       1  Street Triple 2022-11-09         19.0      Taylor     sun
2       2  Street Triple 2022-11-10         17.0    Franklin     sun
3       3         Passat 2022-11-15         22.0      Taylor    snow
4       4         Passat 2022-11-16         19.0      Taylor    snow
5       5         Passat 2022-11-28         21.0      Taylor    rain
6       6         Passat 2022-12-02         19.0    Franklin     sun
7       7  Street Triple 2022-12-03         20.0     Library     sun

In [67]:
grouped_set = commute_clean.groupby('Vehicle').describe()
grouped_set

              TripID                                           CommuteTime  \
               count mean       std  min   25%  50%   75%  max       count
Vehicle
Passat           4.0  4.5  1.290994  3.0  3.75  4.5  5.25  6.0         4.0
Street Triple    4.0  2.5  3.109126  0.0  0.75  1.5  3.25  7.0         4.0


                 mean   std   min     25%    50%    75%   max
Vehicle
Passat         20.250  1.50  19.0  19.000  20.00  21.25  22.0
Street Triple  18.625  1.25  17.0  18.125  18.75  19.25  20.0

In [73]:
grouped_set.loc['Street Triple']['CommuteTime']['max']

20.0

In [75]:
commute.drop(labels=['TripID'], axis=1).groupby(['Vehicle', 'Destination', 'Weather']).describe()

                                  CommuteTime                              \
                                        count  mean      std   min    25%
Vehicle       Destination Weather
Passat        Franklin    sun             1.0  19.0      NaN  19.0  19.00
              Taylor      rain            1.0  21.0      NaN  21.0  21.00
                          snow            2.0  20.5  2.12132  19.0  19.75
Street Triple Franklin    rain            1.0  18.5      NaN  18.5  18.50
                          sun             1.0  17.0      NaN  17.0  17.00
              Library     sun             1.0  20.0      NaN  20.0  20.00
              Taylor      sun             1.0  19.0      NaN  19.0  19.00


                                    50%    75%   max
Vehicle       Destination Weather
Passat        Franklin    sun      19.0  19.00  19.0
              Taylor      rain     21.0  21.00  21.0
                          snow     20.5  21.25  22.0
Street Triple Franklin    rain     18.5  18.50  18.5
                          sun      17.0  17.00  17.0
              Library     sun      20.0  20.00  20.0
              Taylor      sun      19.0  19.00  19.0

In [77]:
# working w. datetime
commute_clean['Date']

0   2022-11-08
1   2022-11-09
2   2022-11-10
3   2022-11-15
4   2022-11-16
5   2022-11-28
6   2022-12-02
7   2022-12-03
Name: Date, dtype: datetime64[ns]

In [78]:
commute_clean['Date'].iloc[0]

Timestamp('2022-11-08 00:00:00')

In [80]:
commute_clean['Date'].iloc[0].year

2022